nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso55s06/project_template/pin_mux.h
/*! @name CAN0_TD (number 41), J18[7]/JP26[2]/U24[13]/CAN__HSSPI_ISP_PIO1_2
  @{ */
/*!
 * @brief Device name: CAN0 */
#define BOARD_INITCANPINS_CAN_TXD_PERIPHERAL CAN0
/*!
 * @brief CAN0 signal: CAN_TD */
#define BOARD_INITCANPINS_CAN_TXD_SIGNAL CAN_TD
/*!
 * @brief Pin name */
#define BOARD_INITCANPINS_CAN_TXD_PIN_NAME CAN0_TD
/*!
 * @brief Label */
#define BOARD_INITCANPINS_CAN_TXD_LABEL "J18[7]/JP26[2]/U24[13]/CAN__HSSPI_ISP_PIO1_2"
/*!
 * @brief Identifier name */
#define BOARD_INITCANPINS_CAN_TXD_NAME "CAN_TXD"
/* @} */

/*! @name CAN0_RD (number 42), J18[5]/JP25[2]/U24[12]/CAN__HSSPI_ISP_PIO1_3
  @{ */
/*!
 * @brief Device name: CAN0 */
#define BOARD_INITCANPINS_CAN_RXD_PERIPHERAL CAN0
/*!
 * @brief CAN0 signal: CAN_RD */
#define BOARD_INITCANPINS_CAN_RXD_SIGNAL CAN_RD
/*!
 * @brief Pin name */
#define BOARD_INITCANPINS_CAN_RXD_PIN_NAME CAN0_RD
/*!
 * @brief Label */
#define BOARD_INITCANPINS_CAN_RXD_LABEL "J18[5]/JP25[2]/U24[12]/CAN__HSSPI_ISP_PIO1_3"
/*!
 * @brief Identifier name */
#define BOARD_INITCANPINS_CAN_RXD_NAME "CAN_RXD"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
